In [338]:
import pandas as pd
import numpy as np

In [4]:
data = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [6]:
data.values

array([1, 2, 3, 4, 5])

In [29]:
type(data.values)

numpy.ndarray

In [8]:
data.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [30]:
type(data.index)

pandas.core.indexes.base.Index

In [14]:
data['a']

np.int64(1)

In [17]:
data['a':'d']

a    1
b    2
c    3
d    4
dtype: int64

In [19]:
data['a':'d':2]

a    1
c    3
dtype: int64

In [26]:
data2 = pd.Series([1,2,3,4])

In [31]:
data2[0:3]

0    0
1    1
2    2
dtype: int64

In [32]:
# Dictonaries to pd.Series

In [73]:
grades_dict = {'A':4.0, 'B':3.5, 'C':3.0, 'D':2.5}
grades = pd.Series(grades_dict)

In [74]:
marks_dict = {'A':85, 'B':75, 'C':65, 'D':55}
marks = pd.Series(marks_dict)

In [157]:
res = pd.DataFrame({'Marks':marks,'Grades':grades})
res['Percentage'] = res['Marks'].astype(str)+'%'

In [171]:
res

   Marks  Grades Percentage
A     85     4.0        85%
B     75     3.5        75%
C     65     3.0        65%
D     55     2.5        55%

In [170]:
res.T

              A    B    C    D
Marks        85   75   65   55
Grades      4.0  3.5  3.0  2.5
Percentage  85%  75%  65%  55%

In [169]:
print(res.index)
print(res.columns)
print(res.values)

Index(['A', 'B', 'C', 'D'], dtype='object')
Index(['Marks', 'Grades', 'Percentage'], dtype='object')
[[85 4.0 '85%']
 [75 3.5 '75%']
 [65 3.0 '65%']
 [55 2.5 '55%']]

In [168]:
G = res[res['Grades'] > 3]
G

   Marks  Grades Percentage
A     85     4.0        85%
B     75     3.5        75%

In [167]:
M = res[res['Marks'] > 60]
M

   Marks  Grades Percentage
A     85     4.0        85%
B     75     3.5        75%
C     65     3.0        65%

In [92]:
#Handle NaN values

In [111]:
a = {'a':1,'b':2}
b = {'b':3,'c':4}
c = pd.DataFrame({'A':a, 'B':b}).T

In [104]:
c

     a    b    c
A  1.0  2.0  NaN
B  NaN  3.0  4.0

In [112]:
c.fillna(0)

     a    b    c
A  1.0  2.0  0.0
B  0.0  3.0  4.0

In [116]:
c

     a    b    c
A  1.0  2.0  NaN
B  NaN  3.0  4.0

In [118]:
c.dropna()

Empty DataFrame
Columns: [a, b, c]
Index: []

In [121]:
a = pd.Series(['a','b','c'], index=[1,2,3])
a

1    a
2    b
3    c
dtype: object

In [126]:
a[1:3] # uses implicit index

2    b
3    c
dtype: object

In [128]:
a.loc[1:3] # uses explicit index

1    a
2    b
3    c
dtype: object

In [166]:
a.iloc[1:3] # uses implicit index

2    b
3    c
dtype: object

In [165]:
res

   Marks  Grades Percentage
A     85     4.0        85%
B     75     3.5        75%
C     65     3.0        65%
D     55     2.5        55%

In [164]:
res[::-1]

   Marks  Grades Percentage
D     55     2.5        55%
C     65     3.0        65%
B     75     3.5        75%
A     85     4.0        85%

In [163]:
res.loc[::-1]

   Marks  Grades Percentage
D     55     2.5        55%
C     65     3.0        65%
B     75     3.5        75%
A     85     4.0        85%

In [162]:
res.loc[::-1,:]

   Marks  Grades Percentage
D     55     2.5        55%
C     65     3.0        65%
B     75     3.5        75%
A     85     4.0        85%

In [161]:
res.iloc[::-1]

   Marks  Grades Percentage
D     55     2.5        55%
C     65     3.0        65%
B     75     3.5        75%
A     85     4.0        85%

In [160]:
res.iloc[::-1,:]

   Marks  Grades Percentage
D     55     2.5        55%
C     65     3.0        65%
B     75     3.5        75%
A     85     4.0        85%

In [3]:
res.iloc[2,:]

In [5]:
g7_pop = pd.Series([35.42, 26.67, 67.36, 43.76, 74.33, 59.34, 54.98])

In [8]:
g7_pop

0    35.42
1    26.67
2    67.36
3    43.76
4    74.33
5    59.34
6    54.98
dtype: float64

In [12]:
g7_pop.values

array([35.42, 26.67, 67.36, 43.76, 74.33, 59.34, 54.98])

In [15]:
g7_pop.index

RangeIndex(start=0, stop=7, step=1)

In [17]:
g7_pop.index = {
    'Canada',
    'France',
    'Germany',
    'Italy',
    'Japan',
    'United Kingdom',
    'United States'
}

In [81]:
g7_pop.name = 'G7 Population in millions'

In [26]:
pd.DataFrame({'Population': g7_pop})

                Population
Canada               35.42
Germany              26.67
France               67.36
United States        43.76
United Kingdom       74.33
Japan                59.34
Italy                54.98

In [45]:
g7_pop['Canada']

np.float64(35.42)

In [48]:
g7_pop.loc['Canada']

np.float64(35.42)

In [50]:
g7_pop.iloc[0]

np.float64(35.42)

In [51]:
g7_pop.iloc[-1]

np.float64(54.98)

In [56]:
g7_pop[['Canada', 'Italy']]

Canada    35.42
Italy     54.98
dtype: float64

In [59]:
g7_pop.iloc[[0, 1]]

Canada     35.42
Germany    26.67
dtype: float64

In [65]:
g7_pop['Canada' : 'Italy']

Canada            35.42
Germany           26.67
France            67.36
United States     43.76
United Kingdom    74.33
Japan             59.34
Italy             54.98
dtype: float64

In [67]:
g7_pop['Canada' : 'Italy' : 2]

Canada            35.42
France            67.36
United Kingdom    74.33
Italy             54.98
dtype: float64

In [68]:
# Boolean Series

In [85]:
g7_pop > 50

Canada            False
Germany           False
France             True
United States     False
United Kingdom     True
Japan              True
Italy              True
Name: G7 Population in millions, dtype: bool

In [84]:
g7_pop[g7_pop > 50]

France            67.36
United Kingdom    74.33
Japan             59.34
Italy             54.98
Name: G7 Population in millions, dtype: float64

In [86]:
# Operations and Methods

In [89]:
g7_pop * 1000000 # Show Population in millions

Canada            35420000.0
Germany           26670000.0
France            67360000.0
United States     43760000.0
United Kingdom    74330000.0
Japan             59340000.0
Italy             54980000.0
Name: G7 Population in millions, dtype: float64

In [91]:
g7_pop.mean()

np.float64(51.69428571428572)

In [93]:
g7_pop.std()

np.float64(17.229157318475036)

In [96]:
import numpy as np
np.log(g7_pop)

Canada            3.567277
Germany           3.283539
France            4.210051
United States     3.778720
United Kingdom    4.308515
Japan             4.083284
Italy             4.006969
Name: G7 Population in millions, dtype: float64

In [98]:
g7_pop['Canada' : 'Italy' : 2].mean()

np.float64(58.0225)

In [104]:
g7_pop[(g7_pop > 30) & (g7_pop < 70)]

Canada           35.42
France           67.36
United States    43.76
Japan            59.34
Italy            54.98
Name: G7 Population in millions, dtype: float64

In [109]:
# Modify Series
g7_pop['Canada'] = 45.23

In [111]:
g7_pop

Canada            45.23
Germany           26.67
France            67.36
United States     43.76
United Kingdom    74.33
Japan             59.34
Italy             54.98
Name: G7 Population in millions, dtype: float64

In [112]:
# More on DataFrames

In [320]:
data = {
    'Population': [1444216107, 1393409038, 332915073, 276361783, 231402117],
    'GDP_Trillions_USD': [17.73, 3.05, 23.00, 1.19, 0.35],
    'Surface_Area_1000_sq_km': [9600, 3287, 9834, 1905, 881],
    'Human_Development_Index': [0.761, 0.645, 0.926, 0.718, 0.557],
    'Continent': ['Asia', 'Asia', 'North America', 'Asia', 'Asia']
}

In [321]:
df = pd.DataFrame(data)

In [322]:
df.index = ['China', 'India', 'United States', 'Indonesia', 'Pakistan']

In [323]:
df

,Population,GDP_Trillions_USD,Surface_Area_1000_sq_km,Human_Development_Index,Continent
China,1444216107,17.73,9600,0.761,Asia
India,1393409038,3.05,3287,0.645,Asia
United States,332915073,23.00,9834,0.926,North America
Indonesia,276361783,1.19,1905,0.718,Asia
Pakistan,231402117,0.35,881,0.557,Asia

In [131]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, China to Pakistan
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Population               5 non-null      int64
 1   GDP_Trillions_USD        5 non-null      float64
 2   Surface_Area_1000_sq_km  5 non-null      int64
 3   Human_Development_Index  5 non-null      float64
 4   Continent                5 non-null      object
dtypes: float64(2), int64(2), object(1)
memory usage: 240.0+ bytes

In [133]:
df.describe()

,Population,GDP_Trillions_USD,Surface_Area_1000_sq_km,Human_Development_Index
count,5.000000e+00,5.000000,5.000000,5.000000
mean,7.356608e+08,9.064000,5101.400000,0.721400
std,6.249240e+08,10.528693,4299.875033,0.138117
min,2.314021e+08,0.350000,881.000000,0.557000
25%,2.763618e+08,1.190000,1905.000000,0.645000
50%,3.329151e+08,3.050000,3287.000000,0.718000
75%,1.393409e+09,17.730000,9600.000000,0.761000
max,1.444216e+09,23.000000,9834.000000,0.926000

In [137]:
df.size

25

In [139]:
df.shape

(5, 5)

In [141]:
df.dtypes

Population                   int64
GDP_Trillions_USD          float64
Surface_Area_1000_sq_km      int64
Human_Development_Index    float64
Continent                   object
dtype: object

In [143]:
df.dtypes.value_counts()

int64      2
float64    2
object     1
Name: count, dtype: int64

In [145]:
df.columns

Index(['Population', 'GDP_Trillions_USD', 'Surface_Area_1000_sq_km',
       'Human_Development_Index', 'Continent'],
      dtype='object')

In [148]:
df.loc['China']

Population                 1444216107
GDP_Trillions_USD               17.73
Surface_Area_1000_sq_km          9600
Human_Development_Index         0.761
Continent                        Asia
Name: China, dtype: object

In [150]:
df.iloc[-1]

Population                 231402117
GDP_Trillions_USD               0.35
Surface_Area_1000_sq_km          881
Human_Development_Index        0.557
Continent                       Asia
Name: Pakistan, dtype: object

In [154]:
df['Population']

China            1444216107
India            1393409038
United States     332915073
Indonesia         276361783
Pakistan          231402117
Name: Population, dtype: int64

In [162]:
df.loc[['China', 'Pakistan'], ['Population', 'Continent']]

          Population Continent
China     1444216107      Asia
Pakistan   231402117      Asia

In [163]:
df.loc['China' : 'Pakistan', ['Population']]

               Population
China          1444216107
India          1393409038
United States   332915073
Indonesia       276361783
Pakistan        231402117

In [171]:
df.iloc[0 : 3, 0 : 2]

               Population  GDP_Trillions_USD
China          1444216107              17.73
India          1393409038               3.05
United States   332915073              23.00

In [180]:
df[df['Population'] > 332915073]

,Population,GDP_Trillions_USD,Surface_Area_1000_sq_km,Human_Development_Index,Continent
China,1444216107,17.73,9600,0.761,Asia
India,1393409038,3.05,3287,0.645,Asia

In [184]:
df.loc[df['Population'] > 332915073, ['Population']]

       Population
China  1444216107
India  1393409038

In [188]:
df.loc[df['Population'] > 332915073, ['Population', 'GDP_Trillions_USD']]

       Population  GDP_Trillions_USD
China  1444216107              17.73
India  1393409038               3.05

In [194]:
crisis = pd.Series([-0.1, -0.3], index=['GDP_Trillions_USD', 'Human_Development_Index'])

In [196]:
df[['GDP_Trillions_USD', 'Human_Development_Index']] + crisis

   GDP_Trillions_USD  Human_Development_Index
0              17.63                    0.461
1               2.95                    0.345
2              22.90                    0.626
3               1.09                    0.418
4               0.25                    0.257

In [324]:
langs = pd.Series(
    ['Chineese', 'Urdu', 'Indonesian'],
    index=['China', 'Pakistan', 'Indonesia'],
    name='Language'
)

In [325]:
df['Language'] = langs

In [326]:
# df.loc[df['Language'].isna(), 'Language' ] = 'English'
df['Language'] = df['Language' ].fillna('English')

In [327]:
df

,Population,GDP_Trillions_USD,Surface_Area_1000_sq_km,Human_Development_Index,Continent,Language
China,1444216107,17.73,9600,0.761,Asia,Chineese
India,1393409038,3.05,3287,0.645,Asia,English
United States,332915073,23.00,9834,0.926,North America,English
Indonesia,276361783,1.19,1905,0.718,Asia,Indonesian
Pakistan,231402117,0.35,881,0.557,Asia,Urdu

In [328]:
# Change Column and Index Name
# # Temporary
# df.rename(
#     columns={'GDP_Trillions_USD':'GDP', 
#              'Surface_Area_1000_sq_km':'Surface', 
#              'Human_Development_Index':'HDI'},
#     index={'United States':'US'}
# )

# Permanent
df.rename(
    columns={'GDP_Trillions_USD':'GDP', 
             'Surface_Area_1000_sq_km':'Surface', 
             'Human_Development_Index':'HDI'},
    index={'United States':'US'},
    inplace=True
)

In [329]:
df

           Population    GDP  Surface    HDI      Continent    Language
China      1444216107  17.73     9600  0.761           Asia    Chineese
India      1393409038   3.05     3287  0.645           Asia     English
US          332915073  23.00     9834  0.926  North America     English
Indonesia   276361783   1.19     1905  0.718           Asia  Indonesian
Pakistan    231402117   0.35      881  0.557           Asia        Urdu

In [330]:
df['Population'] = df['Population'] / 100000000

In [332]:
df['GDP/Capita'] = df['GDP'] / df['Population']

In [337]:
df

,Population,GDP,Surface,HDI,Continent,Language,GDP/Capita
China,14.442161,17.73,9600,0.761,Asia,Chineese,1.227656
India,13.934090,3.05,3287,0.645,Asia,English,0.218888
US,3.329151,23.00,9834,0.926,North America,English,6.908669
Indonesia,2.763618,1.19,1905,0.718,Asia,Indonesian,0.430595
Pakistan,2.314021,0.35,881,0.557,Asia,Urdu,0.151252

# Handling Missing Data

In [340]:
pd.isnull(np.nan)

True

In [342]:
pd.isnull(None)

True

In [344]:
pd.isna(np.nan)

True

In [346]:
pd.isna(None)

True

In [348]:
pd.notnull(np.nan)

False

In [350]:
pd.notnull(None)

False

In [352]:
pd.notnull(3)

True

These Functions also work with Series & DataFrame

In [375]:
s = pd.Series([1, np.nan, 2])

In [376]:
pd.isnull(s)

0    False
1     True
2    False
dtype: bool

In [377]:
pd.notnull(s)

0     True
1    False
2     True
dtype: bool

In [469]:
df = pd.DataFrame({
    'A':[1, np.nan, 3],
    'B':[4, 5, np.nan],
    'C':[7, np.nan, 9],
    'D':[10, 11, 12]
})
df

     A    B    C   D
0  1.0  4.0  7.0  10
1  NaN  5.0  NaN  11
2  3.0  NaN  9.0  12

In [448]:
pd.isnull(df)

       A      B      C
0  False  False   True
1   True  False  False
2  False   True   True

In [449]:
pd.notnull(df)

       A      B      C
0   True   True  False
1  False   True   True
2   True  False  False

# Pandas Operations with Missing Values

In [380]:
s.sum()

np.float64(3.0)

In [381]:
s.count()

np.int64(2)

In [378]:
df.sum()

A    3.0
B    3.0
dtype: float64

In [379]:
df.count()

A    2
B    2
dtype: int64

# Filtering Missing Data

In [434]:
s = pd.Series([1, 2, 3, np.nan, np.nan, 6, np.nan])

In [435]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    6.0
dtype: float64

In [436]:
s[pd.isnull(s)]

3   NaN
4   NaN
6   NaN
dtype: float64

In [437]:
s[s.notnull()]

0    1.0
1    2.0
2    3.0
5    6.0
dtype: float64

In [397]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4    False
5     True
6    False
dtype: bool

In [440]:
pd.notnull(s).count()

np.int64(7)

In [441]:
s.count()

np.int64(4)

In [442]:
s.notnull()

0     True
1     True
2     True
3    False
4    False
5     True
6    False
dtype: bool

# Dropping null values on Series

In [443]:
s = s.dropna()

In [444]:
s = s.reset_index(drop=True)

In [445]:
s

0    1.0
1    2.0
2    3.0
3    6.0
dtype: float64

# Dropping null values on DataFrame

In [453]:
df

     A    B    C
0  1.0  1.0  NaN
1  NaN  2.0  2.0
2  2.0  NaN  NaN

In [457]:
df.isnull()

       A      B      C
0  False  False   True
1   True  False  False
2  False   True   True

In [459]:
df.isnull().sum()

A    1
B    1
C    2
dtype: int64

In [461]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      float64
 1   B       2 non-null      float64
 2   C       1 non-null      float64
dtypes: float64(3)
memory usage: 204.0 bytes

In [465]:
df.shape

(3, 3)

In [471]:
df.dropna()

     A    B    C   D
0  1.0  4.0  7.0  10

In [474]:
df.dropna(axis=0)

     A    B    C   D
0  1.0  4.0  7.0  10

In [476]:
df.dropna(axis=1)

    D
0  10
1  11
2  12

In [479]:
df.dropna(how='any') # default

     A    B    C   D
0  1.0  4.0  7.0  10

In [481]:
df.dropna(how='all')

     A    B    C   D
0  1.0  4.0  7.0  10
1  NaN  5.0  NaN  11
2  3.0  NaN  9.0  12

In [484]:
df.dropna(thresh=3)

     A    B    C   D
0  1.0  4.0  7.0  10
2  3.0  NaN  9.0  12

In [486]:
df.dropna(thresh=3, axis=0)

     A    B    C   D
0  1.0  4.0  7.0  10
2  3.0  NaN  9.0  12

In [490]:
df.dropna(thresh=3, axis=1)

    D
0  10
1  11
2  12

# Filling NaN values on Series

In [498]:
s = pd.Series([1, 2, 3, np.nan, np.nan, 6, np.nan])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    6.0
6    NaN
dtype: float64

In [499]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    6.0
6    0.0
dtype: float64

In [502]:
s.fillna(s.mean())

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    6.0
6    3.0
dtype: float64

In [518]:
s.ffill() # Fill NA/NaN values by propagating the last valid observation to next valid.

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    6.0
6    6.0
dtype: float64

In [513]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    6.0
6    NaN
dtype: float64

In [519]:
s.bfill() # Fill NA/NaN values by using the next valid observation to fill the gap.

0    1.0
1    2.0
2    3.0
3    6.0
4    6.0
5    6.0
6    NaN
dtype: float64

# Filling NaN values on DataFrame

In [521]:
df

     A    B    C   D
0  1.0  4.0  7.0  10
1  NaN  5.0  NaN  11
2  3.0  NaN  9.0  12

In [523]:
df.fillna({'A':df['A'].median(), 'B':df['B'].mean(), 'C':0, 'D':9})

     A    B    C   D
0  1.0  4.0  7.0  10
1  2.0  5.0  0.0  11
2  3.0  4.5  9.0  12

In [530]:
df.ffill(axis=0)

     A    B    C   D
0  1.0  4.0  7.0  10
1  1.0  5.0  7.0  11
2  3.0  5.0  9.0  12

In [532]:
df.ffill(axis=1)

     A    B    C     D
0  1.0  4.0  7.0  10.0
1  NaN  5.0  5.0  11.0
2  3.0  3.0  9.0  12.0

In [534]:
df.bfill(axis=0)

     A    B    C   D
0  1.0  4.0  7.0  10
1  3.0  5.0  9.0  11
2  3.0  NaN  9.0  12

In [537]:
df.bfill(axis=1)

     A    B     C     D
0  1.0  4.0   7.0  10.0
1  5.0  5.0  11.0  11.0
2  3.0  9.0   9.0  12.0

# Cleaning not-null values

In [590]:
df = pd.DataFrame({
    'Gender':['M', 'F', 'F', 'D', '?'],
    'Age':[29, 300, 24, 290, 25]
})

In [551]:
df

  Gender  Age
0      M   29
1      F   30
2      F   24
3      D  290
4      ?   25

In [591]:
df['Gender'].unique()

array(['M', 'F', 'D', '?'], dtype=object)

In [554]:
df['Gender'].replace('D', 'M')

0    M
1    F
2    F
3    M
4    ?
Name: Gender, dtype: object

In [592]:
df['Gender'] =  df['Gender'].replace({'D':'M', '?':'F'})

In [566]:
df.replace({
    'Gender':{'D':'M', '?':'F'},
    'Age':{290:29}
})

  Gender  Age
0      M   29
1      F   30
2      F   24
3      M   29
4      F   25

In [595]:
# Replace Invalid Ages
df.loc[df['Age'] > 100, 'Age'] = df.loc[df['Age'] > 100, 'Age'] / 10

In [597]:
df

  Gender  Age
0      M   29
1      F   30
2      F   24
3      M   29
4      F   25

# Handling Duplicates

In [598]:
data = {
    "Alice": "USA",
    "Bob": "Canada",
    "Charlie": "Germany",
    "David": "USA",
    "Eve": "France",
    "Frank": "Canada",
    "Grace": "Germany"
}

In [600]:
s = pd.Series(data)

In [607]:
s.sort_index()

Alice          USA
Bob         Canada
Charlie    Germany
David          USA
Eve         France
Frank       Canada
Grace      Germany
dtype: object

In [618]:
s = s.sort_values()

In [619]:
s

Bob         Canada
Frank       Canada
Eve         France
Charlie    Germany
Grace      Germany
Alice          USA
David          USA
dtype: object

In [620]:
s.duplicated()

Bob        False
Frank       True
Eve        False
Charlie    False
Grace       True
Alice      False
David       True
dtype: bool

In [616]:
s.duplicated(keep='last')

Bob         True
Frank      False
Eve        False
Charlie     True
Grace      False
Alice       True
David      False
dtype: bool

In [622]:
s.duplicated(keep=False)

Bob         True
Frank       True
Eve        False
Charlie     True
Grace       True
Alice       True
David       True
dtype: bool

# DataFrame with Duplicates/

In [623]:
data = {
    "Ambassador": ["Alice", "Bob", "Charlie", "Alice", "Eve", "Frank", "Grace", "Bob"],
    "Country": ["USA", "Canada", "Germany", "USA", "France", "Canada", "Germany", "Canada"],
    "Year": [2019, 2020, 2019, 2019, 2020, 2021, 2019, 2020]
}

In [634]:
df = pd.DataFrame(data)

In [635]:
df.sort_values(by='Country', inplace=True)

In [644]:
df.reset_index(drop=True, inplace=True)

In [648]:
df

  Ambassador  Country  Year
0        Bob   Canada  2020
1      Frank   Canada  2021
2        Bob   Canada  2020
3        Eve   France  2020
4    Charlie  Germany  2019
5      Grace  Germany  2019
6      Alice      USA  2019
7      Alice      USA  2019

In [650]:
df.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7     True
dtype: bool

In [656]:
df.duplicated(subset=['Ambassador'])

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7     True
dtype: bool

In [658]:
df.duplicated(subset=['Ambassador'], keep='last')

0     True
1    False
2    False
3    False
4    False
5    False
6     True
7    False
dtype: bool

In [661]:
df.drop_duplicates().reset_index(drop=True)

  Ambassador  Country  Year
0        Bob   Canada  2020
1      Frank   Canada  2021
2        Eve   France  2020
3    Charlie  Germany  2019
4      Grace  Germany  2019
5      Alice      USA  2019

In [663]:
df.drop_duplicates(subset=['Ambassador']).reset_index(drop=True)

  Ambassador  Country  Year
0        Bob   Canada  2020
1      Frank   Canada  2021
2        Eve   France  2020
3    Charlie  Germany  2019
4      Grace  Germany  2019
5      Alice      USA  2019

In [665]:
df.drop_duplicates(subset=['Country']).reset_index(drop=True)

  Ambassador  Country  Year
0        Bob   Canada  2020
1        Eve   France  2020
2    Charlie  Germany  2019
3      Alice      USA  2019

In [668]:
df.drop_duplicates(subset=['Country'], keep='last').reset_index(drop=True)

  Ambassador  Country  Year
0        Bob   Canada  2020
1        Eve   France  2020
2      Grace  Germany  2019
3      Alice      USA  2019

# Splitting Columns

In [724]:
data = {
    'Data': [
        '1987_M_US_1',
        '19907_M_UK_1',
        '1992_F_US_2',
        '1970?_M_IT_1',
        '1985_F_I T _2'
    ]
}

In [725]:
df = pd.DataFrame(data)

In [700]:
df

            Data
0    1987_M_US_1
1   19907_M_UK_1
2    1992_F_US_2
3   1970?_M_IT_1
4  1985_F_I T _2

In [701]:
df['Data'].str.split('_')

0      [1987, M, US, 1]
1     [19907, M, UK, 1]
2      [1992, F, US, 2]
3     [1970?, M, IT, 1]
4    [1985, F, I T , 2]
Name: Data, dtype: object

In [702]:
df['Data'].str.split('_', expand=True)

       0  1     2  3
0   1987  M    US  1
1  19907  M    UK  1
2   1992  F    US  2
3  1970?  M    IT  1
4   1985  F  I T   2

In [726]:
df = df['Data'].str.split('_', expand=True)

In [727]:
df.columns = ['Year','Gender','Country','No_Children']

In [732]:
df['Country'] = df['Country'].str.strip()

In [734]:
df['Country'] = df['Country'].str.replace(' ', '')

In [737]:
df['Year'] = df['Year'].str.replace('?', '')

In [746]:
df['Year'] = pd.to_numeric(df['Year'], errors='coerce')

In [751]:
df.loc[df['Year'] > 10000, 'Year'] = df.loc[df['Year'] > 10000, 'Year'] / 10

In [754]:
df['Year'] = df['Year'].astype(int)

In [756]:
df

   Year Gender Country No_Children
0  1987      M      US           1
1  1990      M      UK           1
2  1992      F      US           2
3  1970      M      IT           1
4  1985      F      IT           2